Autodesk.Revit.DB.OverrideGraphicSettings.SetCutFillPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the cut surface fill pattern.
fillPatternId:
ElementId of the cut surface fill pattern for the override. InvalidElementId means no override is set. The pattern must be a drafting pattern.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutFillColor(Autodesk.Revit.DB.Color)
Sets the cut surface fill color.
color:
Cut surface fill color for the override (invalidColorValue means no override is set).
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionFillPatternId(Autodesk.Revit.DB.ElementId)
Sets the projection surface fill pattern.
fillPatternId:
ElementId of the projection surface fill pattern for the override. InvalidElementId means no override is set. The pattern must be a drafting pattern.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionFillColor(Autodesk.Revit.DB.Color)
Sets the projection surface fill color.
color:
Value of the projection surface fill color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.InvalidPenNumber
The invalidPenNumber for clearing line wieght overrides.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.CutFillPatternId
ElementId of the cut surface fill pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.CutFillColor
Cut surface fill color.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionFillPatternId
ElementId of the projection surface fill pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionFillColor
Projection surface fill color.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.DetailLevel
The Detail Level.
Since:
2014